HELYXcore-4.4.0/examples/legacy/multiphase/interDyMFoam/laminar/testTubeMixer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-0.5 -5 -0.5)
    ( 0.5 -5 -0.5)
    ( 0.5  5 -0.5)
    (-0.5  5 -0.5)
    (-0.5 -5  0.5)
    ( 0.5 -5  0.5)
    ( 0.5  5  0.5)
    (-0.5  5  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 50 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
